kouple_backend_test.yml
execution:
  iterations: 10
  concurrency: 1
  hold-for: 2m
  ramp-up: 40s
  scenario: kouple-backend

scenarios:
  kouple-backend:
    data-sources: 
    - path: ./users.csv  # this is a full form
      delimiter: ','
      quoted: false
      loop: true
      variable-names: phoneNumber,otp
      random-order: false
    requests:
      - url: https://kouple-backend-docker.herokuapp.com/kouple/v1/api/auth/verify/otp
        method: POST
        label: verifyOTP
        content-encoding: utf-8
        headers: 
          Accept: "application/json"
          Content-Type: "application/json"
        body:
          phoneNumber: ${phoneNumber}
          otp: ${otp}
        extract-jsonpath: 
          accessToken:
            jsonpath: $.data.accessToken
            default: null

      - url: https://kouple-backend-docker.herokuapp.com/kouple/v1/api/account/user/profile
        method: GET
        label: getUserProfile
        content-encoding: utf-8
        headers: 
          Accept: "application/json"
          Content-Type: "application/json"
          Authorization: "Bearer ${accessToken}"